{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-Abschl\u00fcsse",
    "1": "B-Anstellung",
    "2": "B-Arbeitsumfeld",
    "3": "B-Benefits",
    "4": "B-Bewerbungsprozess",
    "5": "B-Challenges",
    "6": "B-Erfahrung",
    "7": "B-Firmenbeschreibung",
    "8": "B-Firmenkundenbeschreibung",
    "9": "B-F\u00e4higkeiten und Inhalte",
    "10": "I-Abschl\u00fcsse",
    "11": "I-Anstellung",
    "12": "I-Arbeitsumfeld",
    "13": "I-Benefits",
    "14": "I-Bewerbungsprozess",
    "15": "I-Challenges",
    "16": "I-Erfahrung",
    "17": "I-Firmenbeschreibung",
    "18": "I-Firmenkundenbeschreibung",
    "19": "I-F\u00e4higkeiten und Inhalte",
    "20": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Abschl\u00fcsse": 0,
    "B-Anstellung": 1,
    "B-Arbeitsumfeld": 2,
    "B-Benefits": 3,
    "B-Bewerbungsprozess": 4,
    "B-Challenges": 5,
    "B-Erfahrung": 6,
    "B-Firmenbeschreibung": 7,
    "B-Firmenkundenbeschreibung": 8,
    "B-F\u00e4higkeiten und Inhalte": 9,
    "I-Abschl\u00fcsse": 10,
    "I-Anstellung": 11,
    "I-Arbeitsumfeld": 12,
    "I-Benefits": 13,
    "I-Bewerbungsprozess": 14,
    "I-Challenges": 15,
    "I-Erfahrung": 16,
    "I-Firmenbeschreibung": 17,
    "I-Firmenkundenbeschreibung": 18,
    "I-F\u00e4higkeiten und Inhalte": 19,
    "O": 20
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
